[{"category":"Programming Language",
"subcategory":"Java",
"definition":"Java is a high level programming language developed by Sun Microsystems released in 1995 and later acquired by Oracle in 2010. Java program/source code is compiled to generate bytecode. This bytecode is executed by interpreter (a part of JVM-Java Virtual Machine).So we can run Java program on any system having JVM. ",
"latestversion":"8",
"yearReleased":"1995",
"ownedBy":"Oracle",
"keyFeatures":"-Object Oriented Language-portable-platform independent(write once run everywhere)-secured(uses runtime environment of its own,that is, JVM and not of the OS)-robust(strong memory management by automatic garbage collection and good exception handling)-high performance-multithreaded(can deal with multiple tasks at once)"},

 {"category":"Programming Language",
 "subcategory":"PHP",
 "definition":"PHP: Hypertext PreProcessor is widely used open source scripting language especially suited for web development and can be embedded in HTML. It is executed on server and result is returned to browser as plain HTML.",
 "latestversion":"5.5",
 "yearReleased":"1994",
 "ownedBy":"Zend Technologies",
 "keyFeatures":"-can run on various platforms(Windows, Linux, Unix, Mac OSX etc.)-compatible with almost all servers used today-PHP scripts are executed on server-can generate dynamic page content, encrypt data and can be used to control user access"},
  
  {"category":"Programming Language",
  "subcategory":"C",
  "definition":"C is a general purpose, procedural language used for developing portable applications. The UNIX operating system, the C compiler and essentially all UNIX application programs have been written in C.",
  "latestversion":"C11",
  "yearReleased":"1972",
 "ownedBy":"Bell Labs",
 "keyFeatures":"-It is procedural programming language, not an object-oriented programming language-programs are organized as modules and functions-supports low-level access to memory using address pointers-supports dynamic memory allocation, which helps to reduce the size of object file generated by the compiler, and allow arrays to be declared with sizes determined at runtime-uses a header file to share declarations of variables and functions of a program module with other modules"},
 
 {"category":"Programming Language",
 "subcategory":"C++",
 "definition":"C++ is a general purpose programming language.It has imperative, object oriented and generic programming features. It also provides facilities for low level memory manipulation.",
 "latestversion":"C++14",
 "yearReleased":"1979",
 "ownedBy":"Bell Labs",
 "keyFeatures":"-Object oriented language-supports multiple inheritance-collection of predefined classes which are data types that can be instantiated multiple times-provides templates and several keywords not found in the C language- try-catch-throw exception handling-we have to explicitly allocate and free object storage"},
 
 {"category":"Programming Language",
 "subcategory":"Objective C",
 "definition":"Objective-C is a general-purpose, object-oriented programming language that adds Smalltalk-style messaging to the C programming language. It was the main programming language used by Apple for the OS X and iOS operating systems, and their respective application programming interfaces (APIs): Cocoa and Cocoa Touch prior to the introduction of Swift.",
 "latestversion":"C++14",
 "yearReleased":"1983",
 "ownedBy":"Apple",
 "keyFeatures":"-classes are objects(to create an object we just need to send a message to the class we want to instantiate)-dynamic typing and optional static typing(that is we can declare an object of class or just any object)-categories let us define new methods and add them to classes-introspection(we can ask an object for its class)-automatic garbage collection"},
 
 {"category":"Versioning Control",
 "subcategory":"SVN",
 "definition":"Apache Subversion(SVN)  is a software versioning and revision control system distributed as free software under the Apache License. Software developers use Subversion to maintain current and historical versions of files such as source code, web pages, and documentation.",
 "latestversion":"1.9.4",
 "yearReleased":"2000",
 "ownedBy":"Apache Software Foundation",
 "keyFeatures":"SVN matches or exceeds CVS's features-it versions directories also just like files-copying,deleting and renaming files are also versioned operations-allows arbitrary metadata(properties) to be attached to any file or directory-commits are atomic-allows branching and copying-merge tracking-file locking"},
 
 {"category":"Versioning Control",
 "subcategory":"CVS",
 "definition":"Concurrent Versions System(CVS), an open-source, network-transparent program that allows developers to keep track of different development versions of source code. CVS does not maintain multiple versions of source code files but keeps a single copy and records of all of the changes that are made. When a developer wants a particular development version of a file, CVS will reconstruct that version based on its records.",
 "latestversion":"1.11.23",
 "yearReleased":"1990",
 "ownedBy":"GNU General Public License",
 "keyFeatures":"-uses client-server architecture(server stores current version of project and clientss connect to the server to get latest copy of project)-server software normally runs on UNIX while clients can run on any OS-several developers can work on same project-anonymous read access can also be allowed for open source projects but for checkins they requires accounts-can maintain branches of a project"},

{"category":"Versioning Control",
 "subcategory":"Rational Clear Case",
 "definition":"IBM ClearCase is an enterprise-grade configuration management system that provides highly secure version control with work and build management support. It be can be integrated with other IBM solutions, including IBM Rational Team Concert, IBM ClearQuest, IBM Rational Asset Manager and IBM Rational Application Developer for WebSphere Software.",
 "latestversion":"9.0",
 "yearReleased":"1992",
 "ownedBy":"IBM",
 "keyFeatures":"-manages files, directories, and other development assets across the lifecycle-Integration with popular development tools including Eclipse, Visual Studio, and Cadence Virtuoso- includes automatic branching and advanced merging and differencing technology-offers electronic signatures, user authentication for secure and controlled access, and audit trails to help meet compliance and governance requirements-helps to streamline the edit,build,debug cycle and reproduce software versions."},
  
 {"category":"Build Tools",
 "subcategory":"ANT",
 "definition":"ANT(Another Neat Tool) is a software tool for automating software build processes. It is implemented using Java language. requires the Java platform and is best suited for building Java projects. It uses XML to describe the build process and its dependencies.",
 "latestversion":"1.9.7",
 "yearReleased":"2000",
 "ownedBy":"Apache Software Foundation",
 "keyFeatures":"-portable(provides a large amount of built in functionality that is designed to behave the same on all platforms)-extremely flexible(does not impose coding conventions or directory layouts)-users of ant can develop their own antlibs containing Ant tasks and types"},
 
 {"category":"Build Tools",
 "subcategory":"Maven",
 "definition":"Maven is a build automation tool used for Java projects.It describes how the software is build and also it describes its dependencies. Maven also aims to assist in project workflow such as release management and issue tracking.",
 "latestversion":"3.3.9",
 "yearReleased":"2004",
 "ownedBy":"Apache Software Foundation",
 "keyFeatures":"-it uses convention for the build procedure and only exceptions need to be written down-the XML file(pom.xml) describes the software project being build ,its dependencies on other modules and components, the build order, the directories and required plugins-it dynamically downloads Java libraries and Maven plugins from repositories like Maven 2 Cnetral Repository and stores them in local cache"},
 
 {"category":"Application and Web Servers",
 "subcategory":"Tomcat",
 "definition":"Apache Tomcat is an open source web server which implements several Java EE specifications including Java Servlet, JavaServer Pages(JSP), WebSocket etc. Apache Tomcat also provides by default a HTTP connector on port 8080, i.e.Tomcat can also be used as HTTP web server. But the performance of Tomcat is not as good as the performance of a designated web server, like the Apache HTTP server.",
 "latestversion":"8.0.33",
 "yearReleased":"1999",
 "ownedBy":"Apache Software Foundation",
 "keyFeatures":"Tomcat can be used as either a separate product with its own internal Web server or mutually with other Web servers, including Apache, Netscape Enterprise Server, Microsoft Internet Information Server (IIS), and Microsoft Personal Web Server-Flexibility(can run actual JSP and servlets on one machine and Tomcat service on other)-Stability(in case of significant failure in Tomcat servlets and JSP pages are still available)-lightweight and effortless."},
 
 {"category":"Application and Web Servers",
 "subcategory":"WebSphere",
 "definition":"IBM WebSphere is an application server that helps you build, deploy and run applications with flexible, secure and Java EE-certified runtime environments—from lightweight production environments to large enterprise deployments.",
 "latestversion":"8.5.5",
 "yearReleased":"1998",
 "ownedBy":"IBM",
 "keyFeatures":"can use WebSphere Application Server on premises or across public, private and hybrid cloud-in addition to Java, WebSphere supports open standard interfaces such as CORBA, JDBC- designed for use across different operating system platforms"},
 
 {"category":"Application and Web Servers",
 "subcategory":"WebLogic",
 "definition":"WebLogic server is based on Java 2 Platform, Enterprise Edition (J2EE), the standard platform used to create Java-based multi-tier enterprise applications.Because J2EE applications are standardized modules, WebLogic can automate many system-level tasks that would otherwise have demanded programming time.",
 "latestversion":"12.2.1",
 "yearReleased":"1997",
 "ownedBy":"Oracle",
 "keyFeatures":"The main features of WebLogic server include connectors that make it possible for any legacy application on any client to interoperate with server applications, Enterprise JavaBean (EJB) components, resource pooling, and connection sharing that make applications very scalable-An administration console with a user interface makes management tasks more efficient and features such as Secure Sockets Layer (SSL) support for the encryption of data transmissions, as well as authentication and authorization mechanisms, make applications and transactions secure."},
 
 {"category":"Application and Web Servers",
 "subcategory":"JBoss",
 "definition":"JBoss Application Server (JBoss AS) now called WildFly is an open-source, cross-platform Java application server developed by JBoss, a division of Red Hat Inc. JBoss AS is an open-source implementation of Java 2 Enterprise Edition (J2EE) that is used for implementing Java applications and other Web-based applications and software. ",
 "latestversion":"10.0.0",
 "yearReleased":"1999",
 "ownedBy":"Red Hat",
 "keyFeatures":"It supports many operating systems, including Portable Operating System Interface for Unix (POSIX) platforms, GNU/Linux, Free Berkeley Software Distribution (FreeBSD), Mac OS X, Microsoft Windows, and other JVM-compliant machines.Main features include clustering, deployment API, distributed caching, distributed deployment, Hibernate integration, Java Authentication and Authorization Service, Java Message Service integration etc."},
 
 {"category":"Web and Graphic Design",
 "subcategory":"Adobe Photoshop",
 "definition":"Adobe Photoshop is a raster graphics editor developed and published by Adobe Systems for Windows and OS X. It can edit and compose raster images in multiple layers and supports masks, alpha compositing and several color models including RGB, CMYK, Lab color space, spot color and duotone.",
 "latestversion":"CC 2015.1.2",
 "yearReleased":"1990",
 "ownedBy":"Adobe Systems",
 "keyFeatures":"Photoshop has vast support for graphic file formats but also uses its own PSD and PSB file formats-plugins(plugins expand the featureset of photoshop)--photoshop tools(like selection tools, editing tools, navigation toolsetc.)-video editing-3D extrusion-mobile integration-3D printing tools-color replacement tool etc."},
 
 {"category":"Web and Graphic Design",
 "subcategory":"Flash",
 "definition":"Adobe Flash (formerly called Macromedia Flash and Shockwave Flash) is a multimedia and software platform used for creating vector graphics, animation, browser games, rich Internet applications, desktop applications, mobile applications and mobile games. Flash displays text, vector and raster graphics to provide animations, video games and applications. It allows streaming of audio and video, and can capture mouse, keyboard, microphone and camera input.",
 "latestversion":"22.0.0.158",
 "yearReleased":"1996",
 "ownedBy":"Adobe Systems",
 "keyFeatures":"Flash gives Web designers the ability to import artwork using whatever bitmap or illustration tool they prefer, and to create animation and special effects, and add sound and interactivity.-Flash movies load faster and save on download time because Flash is vector based whereas HTML is not.-Flash intelligently ‘caches’ it’s movies so they don’t have to be reloaded.-Flash gives the user a more responsive ‘rich-client’ like experience."},
 
 {"category":"Web and Graphic Design",
 "subcategory":"Dreamweaver",
 "definition":"Adobe Dreamweaver is an application used by web designers and developers to create websites and applications for use across multiple targets. Including browsers, devices, and tablets. Web designers use Dreamweaver for creating website prototypes using web-friendly artwork.",
 "latestversion":"CC(2015 16.0.0.7698)",
 "yearReleased":"1997",
 "ownedBy":"Adobe Systems",
 "keyFeatures":"Dreamweaver combines a visual design surface known as Live View and a code editor with standard features such as syntax highlighting, code completion, and code collapsing as well as more sophisticated features such as real-time syntax checking and code introspection for generating code hints to assist the user in writing code.Combined with an array of site management tools, Dreamweaver lets its users design, code and manage websites as well as mobile content. Dreamweaver is positioned as a versatile web design and development tool that enables visualization of web content while coding."},
 
 {"category":"Databases",
 "subcategory":"MySQL",
 "definition":"MySQL is an open-source relational database management system (RDBMS).MySQL is a popular choice of database for use in web applications, and is a central component of the widely used LAMP open-source web application software stack. LAMP is an acronym for Linux, Apache, MySQL, Perl/PHP/Python. Free-software open-source projects that require a full-featured database management system often use MySQL.",
 "latestversion":"5.7.12",
 "yearReleased":"1995",
 "ownedBy":"Oracle",
 "keyFeatures":"Main features are cross platform support, stored procedures, cursors, updatable views, information schema, query caching, nested SELECTS, full  text indexing and searching, embedded database library, shared nothing clustering thrugh MYSQL cluster."},
 
 {"category":"Databases",
 "subcategory":"Oracle",
 "definition":"Oracle database (Oracle DB/Oracle RDBMS/Oracle) is a relational database management system (RDBMS) from the Oracle Corporation.The system is built around a relational database framework in which data objects may be directly accessed by users (or an application front end) through structured query language (SQL).Oracle is a fully scalable relational database architecture and is often used by global enterprises, which manage and process data across wide and local area networks.",
 "latestversion":"12.1.0.2",
 "yearReleased":"1979",
 "ownedBy":"Oracle",
 "keyFeatures":"The main feature is that its architecture is split between the logical and the physical. This structure means that for large-scale distributed computing, also known as grid computing, the data location is irrelevant and transparent to the user, allowing for a more modular physical structure that can be added to and altered without affecting the activity of the database, its data or users.It also allows for a robust system to be devised as there is no single point at which a failure can bring down the database, as the networked schema of the storage resources means that any failure would be local only."},
 
 {"category":"Databases",
 "subcategory":"MongoDB",
 "definition":"MongoDB is a free and open-source cross-platform document-oriented database.Classified as a NoSQL database, MongoDB avoids the traditional table-based relational database structure in favor of JSON-like documents with dynamic schemas (MongoDB calls the format BSON), making the integration of data in certain types of applications easier and faster.",
 "latestversion":"3.2.6",
 "yearReleased":"2009",
 "ownedBy":"MongoDB Inc.",
 "keyFeatures":"Some of the features include ad hoc queries, indexing, replication, load balancing, file storage, aggregation, server side JavaScript execution, capped collections."},
 
 {"category":"Framework",
 "subcategory":"Spring",
 "definition":"The Spring Framework is a Java platform that provides comprehensive infrastructure support for developing Java applications. Spring handles the infrastructure so that the developer can focus on your application.Spring enables developer to build applications from plain old Java objects (POJOs) and to apply enterprise services non-invasively to POJOs. Its main underlying principle is to avoid tight coupling between various modules.",
 "latestversion":"4.2.5",
 "yearReleased":"2002",
 "ownedBy":"VMware",
 "keyFeatures":"It works on POJOs which makes it easier for dependency injection/ injection of test data.- Enhances modularity(provides more readable codes)-Provides loose coupling between different modules-Effective in organizing middle tier applications-Flexible use of dependency injection(can be configured by XML based schema or by annotations)."},
 
 {"category":"Framework",
 "subcategory":"Hibernate",
 "definition":"Hibernate ORM (or Hibernate) is a high performance ORM(Object Relational Mapping) framework for Java language. It provides a framework for mapping an object-oriented domain model(java application) to a relational database. An ORM tool simplifies the data creation, data manipulation and data access. It is a programming technique that maps the object to the data stored in the database.",
 "latestversion":"5.1.0",
 "yearReleased":"2001",
 "ownedBy":"Red Hat",
 "keyFeatures":"-It maps from Java class to database tables and from Java data types to SQL data types-provides data query and retrieval facilities-generates SQL calls and relieves the developer from manual handling and object conversion of the result set.It provides SQL inspired language called HQL(Hibernate Query Language)-provides transparent persistence of POJOs-can be used in standalone Java applications and in Java EE applications using servlets etc."},
 
 {"category":"Framework",
 "subcategory":"Struts 2",
 "definition":"Apache Struts 2 is an open-source web application framework for developing Java EE web applications. It uses and extends the Java Servlet API to encourage developers to adopt a model–view–controller (MVC) architecture. It retains the original architecture of original Struts framework.",
 "latestversion":"2.3.28.1",
 "yearReleased":"2006",
 "ownedBy":"Apache Software Foundation",
 "keyFeatures":"Main features include simple POJO based actions, simplified testability, thread safe, AJAX support, template support, support for different result types,easy to extend with plugins(REST plugin, Spring plugin, Hibernate plugin, jQuery plugin etc.)"},
 
{"category":"Programming Language",
 "subcategory":"Javascript",
 "definition":"JavaScript is a high level, dynamic, untyped and interpreted programming language. Along with HTML, CSS, it is one of the three core technologies of World Wide Web content production. Majority of websites employ it and is supported by all modern web browsers without plugins.It has an API for working with text, arrays, dates and regular expressions. On the client side it has been implemented as an interpreted language. It is also used in game development, desktop and mobile applications and server side network programming.",
 "latestversion":"ECMAScript6",
 "yearReleased":"1995",
 "ownedBy":"The Mozilla Foundation",
 "keyFeatures":"Features include it supports structured programming syntax from C, it is dynamically typed(a type is associated with each value, rather than with each expression.). It is object oriented language but the way it handles the objects and inheritance is different than conventional OOP languages.It can be used on client side as well on server side. All browsers accepts javascript as a scripting language for them and provides integrated support for it."},
 

 {"category":"Library",
 "subcategory":"jQuery",
 "definition":"jQuery is a cross-platform JavaScript library designed to simplify the client-side scripting of HTML.It is most popular JavaScript library used today. jQuery's syntax is designed to make it easier to navigate a document, select DOM elements, create animations, handle events and develope AJAX applications. It also provides capabilities for developers to create plugins on top of the JavaScript library.The modular approach to the jQuery library allows the creation of powerful dynamic web pages and Web applications.",
 "latestversion":"1.12.3",
 "yearReleased":"2006",
 "ownedBy":"",
 "keyFeatures":"Its features include DOM element selections, DOM manipulation based on CSS selectors, events, effects and animations, AJAX, JSON parsing, extensibility through plugins, chaining(each jQuery command returns a jQuery object, so commands can be chained). Besides accessing DOM nodes through jQuery object hierarchy, it is also possible to create new DOM elements."},
  
{"category":"Framework",
 "subcategory":"PhoneGap/ Apache Cordova",
 "definition":"Apache Cordova (formerly PhoneGap) is a popular mobile application development framework.Apache Cordova enables software programmers to build applications for mobile devices using CSS3, HTML5, and JavaScript instead of relying on platform-specific APIs like those in Android, iOS, or Windows Phone.It enables wrapping up of CSS, HTML, and JavaScript code depending upon the platform of the device.It extends the features of HTML and JavaScript to work with the device. The resulting applications are hybrid, meaning that they are neither truly native mobile application (because all layout rendering is done via Web views instead of the platform's native UI framework) nor purely Web-based (because they are not just Web apps, but are packaged as apps for distribution and have access to native device APIs).",
 "latestversion":"6.1.0",
 "yearReleased":"2009",
 "ownedBy":"Adobe Systems",
 "keyFeatures":"PhoneGap has a robust backend system that speeds up the development process and reduces developer’s efforts.It offers great flexibility to the developers as they can develop any type of mobile app without any serious efforts. Developers familiar with basic knowledge of HTML5, CSS3 and JavaScript can get started with PhoneGap.The app developed through phoneGap is for multiple platforms thus maintaining a high level of uniformity. It taps into the device’s hardware such as the camera, geo location, accelerometer and few others making use of the properties of the native resources of the device without compromising on the user experience."},
  
 {"category":"Web Service Protocols",
 "subcategory":"SOAP",
 "definition":"SOAP (Simple Object Access Protocol) is a protocol specification for exchanging structured information in the implementation of web services in computer networks. It uses XML Information Set for its message format, and relies on application layer protocols, most notably Hypertext Transfer Protocol (HTTP) or Simple Mail Transfer Protocol (SMTP), for message negotiation and transmission.",
 "latestversion":"1.2",
 "yearReleased":"1998",
 "ownedBy":"",
 "keyFeatures":"The main characteristics are extensibility(security and WS-routing are among the extensions under development), neutrality(SOAP can operate over any transport protocol such as HTTP, SMTP, TCP, UDP, or JMS) and independence(SOAP allows for any programming model)."},
  
 {"category":"Web Service Protocols",
 "subcategory":"WSDL",
 "definition":"WSDL (Web Services Description Language) is an XML-based interface definition language that is used for describing the functionality offered by a web service. The acronym is also used for any specific WSDL description of a web service (also referred to as a WSDL file), which provides a machine-readable description of how the service can be called, what parameters it expects, and what data structures it returns. Therefore its purpose is roughly similar to that of a method signature in a programming language.",
 "latestversion":"2.0",
 "yearReleased":"2000",
 "ownedBy":"",
 "keyFeatures":"WSDL is often used in combination with SOAP and an XML Schema to provide Web services over the Internet. A client program connecting to a Web service can read the WSDL file to determine what operations are available on the server. Any special datatypes used are embedded in the WSDL file in the form of XML Schema. The client can then use SOAP to actually call one of the operations listed in the WSDL file using for example XML over HTTP."},
 
 {"category":"Networking Protocols",
 "subcategory":"TCP/IP",
 "definition":"The Internet protocol suite is the computer networking model and set of communications protocols used on the Internet.It is commonly known as TCP/IP, because its most important protocols, the Transmission Control Protocol (TCP) and the Internet Protocol (IP) were the first networking protocols defined during its development. TCP/IP provides end-to-end data communication specifying how data should be packetized, addressed, transmitted, routed and received.",
 "latestversion":"IPv6",
 "yearReleased":"1983",
 "ownedBy":"",
 "keyFeatures":"The features of TCP include connection oriented(an application requests a connection to destination and uses connection to transfer data,IP does not uses connections-each datagram is sent independently), point-to-point (A TCP connection has two endpoints), reliability(TCP gurantees that data will be delivered without loss, duplication or transmission errors), full duplex(endpoints can exchange data in both directions simultaneously) and TCP gurantees delivery of all data after endpoint shutdown."},
    
  {"category":"Programming Language",
 "subcategory":"Python",
 "definition":"Python is a widely used high-level, general-purpose, interpreted, dynamic programming language. Its code is readable and its syntax allows programmers to express concepts in fewer lines of code than would be possible in languages such as C++ or Java.",
 "latestversion":"3.5.1",
 "yearReleased":"1991",
 "ownedBy":"Python Software Foundation",
 "keyFeatures":"Python has a variety of basic data types available, supports object-oriented programming with classes and multiple inheritance. Code can be grouped into modules and packages, it supports raising and catching exceptions, data types are strongly and dynamically typed. And it has automatic memory management."},
   
  {"category":"Programming Language",
 "subcategory":"HTML",
 "definition":"HTML(HyperText Markup Language) is the standard markup language used to create web pages. Along with CSS, and JavaScript, HTML is a cornerstone technology used to create web pages, as well as to create user interfaces for mobile and web applications. Web browsers can read HTML files and render them into visible or audible web pages. HTML elements form the building blocks of HTML pages. ",
 "latestversion":"5.0",
 "yearReleased":"1993",
 "ownedBy":"W3C",
 "keyFeatures":"HTML designs the basic frame of any webpage, and then developer can enhance the webpage even more by using CSS and JavaScript.HTML documents imply a structure of nested HTML elements. These are indicated in the document by HTML tags, enclosed in angle brackets.The attributes of the element are name-value pairs.HTML allows images and other objects to be embedded and it can be used to create interactive forms.HTML can embed scripts written in languages such as JavaScript which affect the behavior of HTML web pages."},
 
  {"category":"Programming Language",
 "subcategory":"Ruby",
 "definition":"Ruby is a dynamic, reflective, object-oriented, general-purpose programming language.It supports multiple programming paradigms, including functional, object-oriented, and imperative. It also has a dynamic type system and automatic memory management.",
 "latestversion":"2.3.1",
 "yearReleased":"1995",
 "ownedBy":"",
 "keyFeatures":"The syntax/ infrastructure that makes using anonymous blocks easy. It can seamlessly inherit from any of the standard classes.Everything in Ruby is an object. It has very clean object heirarchy that makes metaprogramming easy."},
 
{"category":"IDE",
 "subcategory":"Visual C++",
 "definition":"Visual C++ (Microsoft Visual C++) is an integrated development environment (IDE) product from Microsoft for the C, C++ and C++/CLI programming languages.It was originally a standalone product but later became a part of Visual Studio.",
 "latestversion":"2015",
 "yearReleased":"1993",
 "ownedBy":"Microsoft",
 "keyFeatures":"It features tools for developing and debugging C++ code, especially code written for Windows API, DirectX and .NET framework. It has an IDE, a C/C++ compiler and a class library called the Microsoft Foundation Classes(MFC). The IDE includes as AppWizard, ClassWizard and testing features."},
 
{"category":"Programming Language",
 "subcategory":"C#",
 "definition":"C#(C sharp) is a multi-paradigm programming language encompassing strong typing, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines. It was developed by Microsoft within its .NET initiative. It is one of the programming languages designed for the Common Language Infrastructure(CLI).",
 "latestversion":"6.0",
 "yearReleased":"2000",
 "ownedBy":"Microsoft",
 "keyFeatures":"Its features are portability(a C# compiler could generate machine code like traditional compilers of C++ or Fortran), more type safe than C++, automatic garbage collection, namespace that provides the same level of code isolation as a Java package or C++ namespace etc."},
       
{"category":"Issue tracking system",
 "subcategory":"JIRA",
 "definition":"Jira/JIRA is an issue tracking product which provides issue tracking, bug tracking and project management functions.Jira is truncation of Gojira, the Japanese name of Godzilla(Jira's main competitor is Bugzilla).",
 "latestversion":"7.0",
 "yearReleased":"2002",
 "ownedBy":"Atlassian Inc.",
 "keyFeatures":"Main features of Jira for agile software development are the functionality to plan development iterations, the iteration reports and the bug tracking functionality. It supports the Networked Hepl Desk API for sharing customer support tickets with other issue tracking systems. It is written in Java and integrates with source control programs like Clearcase, CVS, SVN, Git etc."},

{"category":"Programming Language",
 "subcategory":"SQL",
 "definition":"SQL(Structured Query Language) is a special purpose programming language designed for managing data held in relational database management system(RDBMS). It consists of data definition language, data manipulation language and data control language. Scope of SQL includes data insert, query, update and delete, schema creation and modification and data access control. SQL became a standard of ANSI and ISO.",
 "latestversion":"2011",
 "yearReleased":"1974",
 "ownedBy":"ISO/IEC",
 "keyFeatures":"SQL is used for creating and manipulating databases. It allows user to create, update, delete and retrieve data from a database. High speed(retrieves large amounts of records from db effieciently and quickly), no coding required(it is easier to manage db systems using standard SQL without having to write substantial amount of code), well defined standards exist(non-SQL dbs do not adhere to any clear standard) are some of its features."},
    
 {"category":"Programming Language",
 "subcategory":"PL/SQL",
 "definition":"PL/SQL (Procedural Language/Structured Query Language) is Oracle Corporation's procedural extension for SQL and the Oracle relational database. PL/SQL is available in Oracle Database (since version 7), TimesTen in-memory database (since version 11.2.1), and IBM DB2 (since version 9.7). Oracle Corporation usually extends PL/SQL functionality with each successive release of the Oracle Database.",
 "latestversion":"11.1",
 "yearReleased":"1991",
 "ownedBy":"Oracle",
 "keyFeatures":"PL/SQL includes procedural language elements such as conditions and loops. It allows declaration of constants and variables, procedures and functions, types and variables of those types, and triggers. It can handle exceptions (runtime errors). Arrays are supported involving the use of PL/SQL collections. Implementations from version 8 of Oracle Database onwards have included features associated with object-orientation. One can create PL/SQL units such as procedures, functions, packages, types, and triggers, which are stored in the database for reuse by applications that use any of the Oracle Database programmatic interfaces."},
    
 {"category":"Framework",
 "subcategory":"ASP.NET",
 "definition":"ASP.NET (Active Server Pages.NET) is an open-source server-side web application framework designed for web development to produce dynamic web pages.It allows programmers to build dynamic web sites, web applications and web services. ASP.NET is built on the Common Language Runtime (CLR), allowing programmers to write ASP.NET code using any supported .NET language. ASP.NET's successor is ASP.NET Core. It is a re-implementation of ASP.NET as a modular web framework, together with other frameworks like Entity Framework.",
 "latestversion":"4.6",
 "yearReleased":"2002",
 "ownedBy":"Microsoft",
 "keyFeatures":"It provides better performance by taking advantage of early binding, just-in-time compilation, native optimization, and caching services. It is language independent, has built-in Windows authentication and per application configuration, the applications are secured. APS.NET framework is complemented by a rich toolbox and designer in the Visual Studio IDE."},
 
 {"category":"Extension",
 "subcategory":"AspectJ",
 "definition":"AspectJ is an aspect-oriented programming (AOP) extension for the Java programming language. It is available in Eclipse Foundation open-source projects, both stand-alone and integrated into Eclipse. AspectJ has become a widely used de facto standard for AOP by emphasizing simplicity and usability for end users. It uses Java-like syntax.The AspectJ technologies include a compiler, a debugger, a docmentation generator, a program structure browser and integration with eclipse, ANT, Netbeans etc.and included IDE integrations for displaying crosscutting structure.",
 "latestversion":"1.8.8",
 "yearReleased":"2001",
 "ownedBy":"Eclipse Foundation",
 "keyFeatures":"AspectJ can be used to improve the modularity of software systems. Using ordinary Java, it can be difficult to modularize design concerns such as system-wide error-handling, contract enforcement, distribution concerns, feature variations, context-sensitive behavior, persistence and testing. The code for these concerns tends to be spread out across the system. Because these concerns won't stay inside of any one module boundary, we say that they crosscut the system's modularity."},
   
 {"category":"Programming Language",
 "subcategory":"Visual Basic",
 "definition":"Visual Basic is a third-generation event-driven programming language and integrated development environment (IDE).Visual Basic was derived from BASIC and enables the rapid application development (RAD) of graphical user interface (GUI) applications, access to databases using Data Access Objects, Remote Data Objects, or ActiveX Data Objects, and creation of ActiveX controls and objects.",
 "latestversion":"6.0",
 "yearReleased":"1991",
 "ownedBy":"Microsoft",
 "keyFeatures":"Programming in VB is a combination of visually arranging components or controls on a form, specifying attributes and actions for those components, and writing additional lines of code for more functionality. Since VB defines default attributes and actions for the components, a programmer can develop a simple program without writing much code.Forms are created using drag-and-drop techniques.A tool is used to place controls(like text, boxes) on the form. Controls have attributes and event handlers associated with them.Visual Basic can create executables or ActiveX controls but is primarily used to develop Windows applications and to interface database systems."},
     
 {"category":"Programming Language",
 "subcategory":"Delphi",
 "definition":"Embarcadero Delphi is a programming language and integrated development environment (IDE) for desktop, mobile, web, and console applications.Delphi's compilers use their own Object Pascal dialect of Pascal and generate native code for several platforms: Windows,OS X, iOS and Android.Delphi, part of RAD Studio, includes a code editor with Code Insight, Error Insight, refactoring, an integrated debugger for all platforms including mobile, source control and strong database support.",
 "latestversion":"10.1",
 "yearReleased":"1995",
 "ownedBy":"Embarcadero Technologies",
 "keyFeatures":"Delphi is a strongly typed high-level programming language, intended to be easy to use and originally based on the earlier Object Pascal language.Delphi includes an integrated IDE. The Delphi products all ship with a Visual Component Library (VCL), including most of its source code. "},
       
 {"category":"Testing-Types",
 "subcategory":"Manual Testing",
 "definition":"Manual testing is the process of manually testing software for defects. It requires a tester to play the role of an end user and use most of all features of the application to ensure correct behavior. To ensure completeness of testing, the tester often follows a written test plan that leads them through a set of important test cases.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Main goal is to make sure that the application under test is defect free and software application is working as per the requirement specification document. A test plan document is created describing the detailed and systematic approach to testing a software application. After executing the designed test cases, the differences between actual and expected results are reported as defects."},
     
{"category":"Testing-Types",
 "subcategory":"Automation Testing",
 "definition":"Test automation/automation testing is the use of special software (separate from the software being tested) to control the execution of tests and the comparison of actual outcomes with predicted outcomes. Test automation can automate some repetitive but necessary tasks in a formalized testing process already in place, or perform additional testing that would be difficult to do manually. Test automation is critical for continuous delivery and continuous testing.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Test automation is very useful in cases when low level interface regression testing can be laborious and time consuming manually or when manually it is not possible to find certain classes of defects.It is useful for the software products which have long maintainence life. Even minor patches can break the existing features. So once automated tests are developed, they can be run quickly and repeatedly."},
 
 {"category":"Testing-Methods",
 "subcategory":"Black Box Testing",
 "definition":"Black-box testing is a method of software testing that examines the functionality of an application without looking into its internal structures or workings. This method of test can be applied to virtually every level of software testing: unit, integration, system and acceptance. ",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Specific knowledge of the application's code/internal structure and programming knowledge in general is not required. The tester is aware of what the software is supposed to do but is not aware of how it does it. Test cases are built around specifications and requirements, i.e., what the application is supposed to do. Test cases are generally derived from external descriptions of the software, including specifications, requirements and design parameters."},
    
 {"category":"Testing-Methods",
 "subcategory":"White Box Testing",
 "definition":"White-box testing/glass box testing is a method of testing software that tests internal structures or workings of an application, as opposed to its functionality.  In white-box testing an internal perspective of the system, as well as programming skills, are used to design test cases. White-box testing can be applied at the unit, integration and system levels of the software testing process.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"In this method testing is done at the level of source code.White box testing is the use of techniques like control flow testing, data flow testing, path testing, decision coverage etc. to create an error free environment by examining any fragile code.The whole point of white-box testing is the ability to know which line of the code is being executed and being able to identify what the correct output should be."},   

{"category":"Testing-Methods",
 "subcategory":"Gray Box Testing",
 "definition":"Gray(grey)-box testing is a combination of white-box testing and black-box testing. The aim of this testing is to search for the defects if any due to improper structure or improper usage of applications. A gray-box tester partially knows the internal structure, which includes access to the documentation of internal data structures as well as the algorithms used.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Gray-box testing is beneficial because it takes the straightforward technique of black-box testing and combines it with the code-targeted systems in white-box testing.Gray-box testing is based on requirement test case generation because it presents all the conditions before the program is tested by using the assertion method. A requirement specification language is used to make it easy to understand the requirements and verify its correctness."},                              

{"category":"Testing-Types",
 "subcategory":"Functional Testing",
 "definition":"Functional testing is a quality assurance (QA) process and a type of black-box testing that bases its test cases on the specifications of the software component under test. Functions are tested by feeding them input and examining the output. Functional testing usually describes what the system does. Some types of functional testing are smoke testing, sanity testing, regression testing and usability testing.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The steps involved in functional testing are- The identification of functions that the software is expected to perform. The creation of input data based on the function's specifications. The determination of output based on the function's specifications. The execution of the test case. The comparison of actual and expected outputs. To check whether the application works as per the customer need."},
                               
{"category":"Testing-Levels",
 "subcategory":"Unit Testing",
 "definition":"Unit testing is a testing method in which individual units of source code, sets of one or more computer program modules together with associated control data, usage procedures, and operating procedures, are tested to determine whether they are fit for use. A unit is the smallest testable part of an application(entire module, individual function, procedure or may be class or an individual method). Unit tests are short code fragments created by programmers or occasionally by white box testers during the development process. Unit tests are typically written and run by software developers to ensure that code meets its design and behaves as intended. ",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Unit testing finds the problems early in development cycle, allows programmer to refactor code or upgrade system libraries later, it reduces uncertainity in units themselvesmaking integration testing easier. Unit testing provides a sort of living documentation of the system. Developers looking to learn what functionality is provided by a unit, and how to use it, can look at the unit tests to gain a basic understanding of the unit's interface (API)."},
                               
{"category":"Testing-Levels",
 "subcategory":"Integration Testing",
 "definition":"Integration testing (sometimes called integration and testing, abbreviated I&T) is the phase in software testing in which individual software modules are combined and tested as a group. It occurs after unit testing and before validation testing. Integration testing takes as its input modules that have been unit tested, groups them in larger aggregates, applies tests defined in an integration test plan to those aggregates, and delivers as its output the integrated system ready for system testing.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The purpose of integration testing is to verify functional, performance, and reliability requirements placed on groups of units. Appropriate parameter and data inputs are given to these group of units and success and error cases are checked.Test cases are constructed to test whether all the components within assemblages interact correctly."},

{"category":"Testing-Levels",
 "subcategory":"System Testing",
 "definition":"System testing of software or hardware is testing conducted on a complete, integrated system to evaluate the system's compliance with its specified requirements. System testing falls within the scope of black-box testing, and as such, should require no knowledge of the inner design of the code or logic. As a rule, system testing takes, as its input, all of the integrated software components that have passed integration testing and also the software system itself integrated with any applicable hardware system.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The purpose of integration testing is to detect any inconsistencies between the software units that are integrated together (called assemblages) or between any of the assemblages and the hardware. System testing is a more limited type of testing; it seeks to detect defects both within the inter-assemblages and also within the system as a whole. The different types of testing that should be considered during System testing are - Graphical user interface testing, Usability testing, Software performance testing, compatibility testing, exception handling, load testing, stress testing, security testing, scalability testing, sanity testing, smoke testing etc."},

{"category":"Testing-Levels",
 "subcategory":"Regression Testing",
 "definition":"Regression testing verifies that software previously developed and tested still performs correctly after it was changed or interfaced with other software. Changes may include software enhancements, patches, configuration changes, etc. During regression testing, new software bugs or regressions may be uncovered. Sometimes a software change impact analysis is performed to determine what areas could be affected by the proposed changes. These areas may include functional and non-functional areas of the system.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The purpose of regression testing is to ensure that any changes later in the software have not introduced new faults. One of the main reasons for regression testing is to determine whether a change in one part of the software affects other parts of the software. Common methods of regression testing include rerunning previously completed tests and checking whether program behavior has changed and whether previously fixed faults have re-emerged. Regression testing can be used not only for testing the correctness of a program, but often also for tracking the quality of its output. Regression tests can be functional tests or unit tests."},

{"category":"Testing-Levels",
 "subcategory":"Acceptance Testing",
 "definition":"Acceptance testing(or User Acceptance Testing-UAT/End User Testing) is formal testing with respect to user needs, requirements, and business processes conducted to determine whether a system satisfies the acceptance criteria and to enable the user, customers or other authorized entity to determine whether or not to accept the system. A smoke test may be used as an acceptance test prior to introducing a build of software to the main testing process.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The objective is to provide confidence that the developed product meets both the functional and non-functional requirements. The purpose of conducting acceptance testing is that once completed, and provided the acceptance criteria are met, it is expected the sponsors will sign-off on the product development/enhancement as satisfying the defined requirements (previously agreed between business and product provider/developer)."},

{"category":"Testing-Levels",
 "subcategory":"Alpha Testing",
 "definition":"Alpha testing is testing of an application when development is about to complete. Minor design changes can still be made as a result of alpha testing. It is performed by a group that is independent of the design team, but still within the company, e.g. in-house software test engineers, or software QA engineers.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Alpha testing is final testing before the software is released to the general public. It has two phases: In the first phase of alpha testing, the software is tested by in-house developers. They use either debugger software, or hardware-assisted debuggers. The goal is to catch bugs quickly. In the second phase of alpha testing, the software is handed over to the QA staff, for additional testing in an environment that is similar to the intended use. Alpha testing is often employed for off-the-shelf software as a form of internal acceptance testing, before the software goes to beta testing."},

{"category":"Testing-Levels",
 "subcategory":"Beta Testing",
 "definition":"Beta testing takes place at customer’s site. It sends the system to users who install it and use it under real-world working conditions. It is the second phase of software testing in which a sampling of the intended audience tries the product out. The goal is to place your application in the hands of real users outside of your own engineering team to discover any flaws or issues from the user’s perspective that you would not want to have in your final, released version of the application.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"During beta testing users can install, test application, and send feedback to the developer during this beta testing period. The more issues are fixed that solve real user problems, the higher the quality of application when it is released to the general public which will finally increase customer satisfaction."},

{"category":"Testing-Types",
 "subcategory":"Non functional Testing",
 "definition":"Non-functional testing is the testing of a software application or system for its non-functional requirements: the way a system operates, rather than specific behaviours of that system. The names of many non-functional tests are often used interchangeably because of the overlap in scope between various non-functional requirements. For example, software performance is a broad term that includes many specific requirements like reliability and scalability.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Non-functional testing includes: endurance testing, load testing, performance testing, recovery testing, security testing, scalability testing, stress testing, usability testing etc."},

{"category":"Testing-Types",
 "subcategory":"Performance Testing",
 "definition":"Performance testing is a a testing practice performed to determine how a system performs in terms of responsiveness and stability under a particular workload. It can also serve to investigate, measure, validate or verify other quality attributes of the system, such as scalability, reliability and resource usage. The details of performance specifications are documented in the performance test plan.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The goal of performance testing is to identify the “weakest link” – there is inevitably a part of the system which, if it is made to respond faster, will result in the overall system running faster. It is sometimes a difficult task to identify which part of the system represents this critical path, and some test tools include instrumentation that runs on the server (agents) and reports transaction times, database access times, network overhead, and other server monitors, which can be analyzed together with the raw performance statistics."},

{"category":"Testing-Types",
 "subcategory":"Load Testing",
 "definition":"Load testing is the process of putting demand on a software system or computing device and measuring its response. Load testing is performed to determine a system's behavior under both normal and anticipated peak load conditions. It helps to identify the maximum operating capacity of an application as well as any bottlenecks and determine which element is causing degradation. When the load placed on the system is raised beyond normal usage patterns to test the system's response at unusually high or peak loads, it is known as stress testing. The load is usually so great that error conditions are the expected result, but there is no clear boundary when an activity ceases to be a load test and becomes a stress test.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"Load testing generally refers to the practice of modeling the expected usage of a software program by simulating multiple users accessing the program concurrently. When customers visit the web site, a script recorder records the communication and then creates related interaction scripts. A load generator tries to replay the recorded scripts, which could possibly be modified with different test parameters before replay. In the replay procedure, both the hardware and software statistics will be monitored and collected by the conductor, these statistics include the CPU, memory, disk IO of the physical servers and the response time, throughput of the System Under Test etc. And at last, all these statistics will be analyzed and a load testing report will be generated."},

{"category":"Testing-Types",
 "subcategory":"Stress Testing",
 "definition":"Stress testing is a form of deliberately intense or thorough testing used to determine the stability of a given system or entity. It involves testing beyond normal operational capacity, often to a breaking point, in order to observe the results. ",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The goal of stress testing is to determine breaking points or safe usage limits, to confirm intended specifications are being met, to determine modes of failure (how exactly a system fails) and to test stable operation of a part or system outside standard usage.A system stress test refers to tests that put a greater emphasis on robustness, availability, and error handling under a heavy load, rather than on what would be considered correct behavior under normal circumstances. In particular, the goals of such tests may be to ensure the software does not crash in conditions of insufficient computational resources (such as memory or disk space) or unusually high concurrency."},

{"category":"Testing-Types",
 "subcategory":"Usability Testing",
 "definition":"In usability testing, the testers tests the ease with which the user interfaces can be used. It tests that whether the application or the product built is user-friendly or not. It also reveals whether users feel comfortable with your application or Web site according to different parameters – the flow, navigation and layout, speed and content – especially in comparison to prior or similar applications.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"It goal is to test how easy it is to use the software, learn the software and how convenient is the software to the end user, how fast can experienced users accomplish tasks, when users return to the design after a period of not using it, does the user remember enough to use it effectively the next time, or does the user have to start over again learning everything, how many errors do users make, how severe are these errors and how easily can they recover from the errors etc."},

{"category":"Testing-Types",
 "subcategory":"Security Testing",
 "definition":"Security testing is a process intended to reveal flaws in the security mechanisms of an information system that protect data and maintain functionality as intended. Due to the logical limitations of security testing, passing security testing is not an indication that no flaws exist or that the system adequately satisfies the security requirements. Actual security requirements tested depend on the security requirements implemented by the system.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"The security testing is performed to check whether there is any information leakage in the sense by encrypting the application or using wide range of software’s and hardware’s and firewall etc."},

{"category":"Testing-Types",
 "subcategory":"Portability Testing",
 "definition":"Portability testing is the process of determining the degree of ease or difficulty to which a software component or application can be effectively and efficiently transferred from one hardware, software or other operational or usage environment to another. The test results, defined by the individual needs of the system, are some measurement of how easily the component or application will be to integrate into the environment and these results will then be compared to the software system's non-functional requirement of portability for correctness. The levels of correctness are usually measured by the cost to adapt the software to the new environment compared to the cost of redevelopment.",
 "latestversion":"",
 "yearReleased":"",
 "ownedBy":"",
 "keyFeatures":"When multiple subsystems share components of a larger system, portability testing can be used to help prevent propagation of errors throughout the system. Changing or upgrading to a newer system, adapting to a new interface or interfacing a new system in an existing environment are all problems that software systems with longevity will face sooner or later and properly testing the environment for portability can save on overall cost throughout the life of the system. A general guideline for portability testing is that it should be done if the software system is designed to move from one hardware platform, operating system, or web browser to another."},
 
 {"category":"Testing-Tools",
 "subcategory":"Selenium",
 "definition":"Selenium is a portable software testing framework for web applications. Selenium provides a record/playback tool for authoring tests without learning a test scripting language (Selenium IDE). It also provides a test domain-specific language (Selenese) to write tests in a number of popular programming languages, including Java, C#, Groovy, Perl, PHP, Python and Ruby. The tests can then be run against most modern web browsers. Selenium deploys on Windows, Linux, and Macintosh platforms.",
 "latestversion":"2.48.2",
 "yearReleased":"2004",
 "ownedBy":"Apache",
 "keyFeatures":"Selenium is open source software, supports multiple languages like Java, C#, Python etc. for creating test cases, executes tests in parallel on multiple OS, browser combinations using Selenium Grid, and supports all popular browsers and versions. The components of Selenium are Selenium IDE, Selenium Client API, Selenium Remote Control, Selenium Web Driver and Selenium Grid."},
 
  {"category":"Testing-Tools",
 "subcategory":"JMeter",
 "definition":"Apache JMeter is an Apache project that can be used as a load testing tool for analyzing and measuring the performance of a variety of services, with a focus on web applications. JMeter can be used as a unit-test tool for JDBC database connections, FTP, LDAP, Webservices, JMS, HTTP, generic TCP connections and OS native processes. It can be used for some functional testing as well.",
 "latestversion":"3.0",
 "yearReleased":"1998",
 "ownedBy":"Apache",
 "keyFeatures":"Features of JMeter include JMeter thread can be equivalent of 10 or more users, it may be used to test performance on static and dynamic resources such as static files, servlets, FTP servers, Java Objects, databases, CGI scripts, queries etc. JMeter is platform independent and it has lot many configuration mechanism like HTTP Request, FTP Request, Java Request, SOAP request etc."},
 
 {"category":"Testing-Tools",
 "subcategory":"Mockito",
 "definition":"Mockito is an open source testing framework for Java which allows the creation of test double objects (mock objects) in automated unit tests for the purpose of Test-driven Development (TDD) or Behavior Driven Development (BDD). This mock testing framework effectively fake some external dependencies so that the object neing tested has a consistent interaction with its outside dependencies. Mockito intends to streamline the delivery of these external dependencies that are not subjects of the test.",
 "latestversion":"1.10.19",
 "yearReleased":"2008",
 "ownedBy":"MIT",
 "keyFeatures":"Mockito distinguishes itself from other mocking frameworks by allowing developers to verify the behavior of the system under test (SUT) without establishing expectations beforehand. Mockito attempts to eliminate the expect-run-verify pattern by removing the specification of expectations, so the coupling of test code to the system under test is reduced or minimized. Mockito also provides some annotations useful for reducing boilerplate code."},
 
 {"category":"Testing-Tools",
 "subcategory":"Mercury Quality Center",
 "definition":"Mercury Quality Centre/HP Quality Center is a web-based quality management software. It gives you a centralized control over the entire testing life cycle. It gives an easy interface to manage and organize activities like Requirements coverage, Test Case Management, Test Execution Reporting, Defect Management, and Test Automation. All these activities are provided from a single tool, which is web-based and can be accessed from any where.",
 "latestversion":"12.01",
 "yearReleased":"1995",
 "ownedBy":"Hewlett-Packard",
 "keyFeatures":"It helps make project management, from requirements to deployment easier. It increases predictability and creates a framework to manage projects from a central repository.It hepls to define and maitain requirements and tests, create tests, organize tests into logical subsets, schedule tests and execute them, collect results and analyze the data, create monitor and analyze defects, share defects across projects, track progress of a project, collect metrics and share asset libraries across projects."},
 
 {"category":"Testing-Tools",
 "subcategory":"LoadRunner",
 "definition":"LoadRunner(HPE LoadRunner) is a software testing tool used to test applications, measuring system behaviour and performance under load. It can simulate thousands of users concurrently using application software, recording and later analysing the performance of key components of the application.",
 "latestversion":"12.50",
 "yearReleased":"2000",
 "ownedBy":"Hewlett-Packard",
 "keyFeatures":"LoadRunner simulates user activity by generating messages between application components or by simulating interactions with the user interface such as keypresses or mouse movements. The messages/interactions to be generated are stored in scripts. LoadRunner can generate the scripts by recording them, such as logging HTTP requests between a client web browser and an application's web server. Modules are available to enable HP LoadRunner to capture, replay and script different application and networking technologies."},
 
 {"category":"Testing-Tools",
 "subcategory":"JUnit",
 "definition":"JUnit is a unit testing framework for Java. JUnit has been important in the development of test-driven development, and is one of a family of unit testing frameworks which is collectively known as xUnit that originated with SUnit. JUnit is linked as a JAR at compile-time; the framework resides under package junit.framework for JUnit 3.8 and earlier, and under package org.junit for JUnit 4 and later.",
 "latestversion":"4.12",
 "yearReleased":"1998",
 "ownedBy":"Eclipse Public License",
 "keyFeatures":"The features of JUnit are annotations to identify the test methods(After JUnit4), assertions for testing expected results, test fixtures for sharing common test data(a test fixture ensures that there is a fixed environment in which tests are run so that results are repeatable), tests runner for running the tests and test suite(it bundles the unit tests and run it together) etc."},

 {"category":"Testing-Tools",
 "subcategory":"TestNG",
 "definition":"TestNG is a testing framework for the Java programming language inspired by JUnit and NUnit. The design goal of TestNG is to cover a wider range of test categories: unit, functional, end-to-end, integration, etc., with more powerful and easy-to-use functionalities.",
 "latestversion":"6.8",
 "yearReleased":"2004",
 "ownedBy":"Apache License",
 "keyFeatures":"The main features include annotation support, support for parameterized and data driven testing, support for multiple instances of the same test class, flexible execution model(TestNG can be run either by Ant via build.xml or by an IDE plugin with visual results), concurrent testing(run tests in big thread pools with different policies and test whether the code is multithread safe), default JDK functions for runtime and logging, dependent methods for application server testing, distributed testing(allows distribution of tests on slave machines) etc."},
  
 {"category":"Versioning Control",
 "subcategory":"Git",
 "definition":"Git is a version control system that is widely used for software development and other version control tasks. It is a distributed revision control system with an emphasis on speed, data integrity, and support for distributed, non-linear workflows. Every Git working directory is a full-fledged repository with complete history and full version-tracking capabilities, independent of network access or a central server. Git is free software distributed under terms of GNU General Public License. It is not same as GitHub. GitHub is a hosting service for Git repositories.",
 "latestversion":"2.8.3",
 "yearReleased":"2005",
 "ownedBy":"GNU General Public License",
 "keyFeatures":"It has strong support for non linear development(supports rapid branching and merging and has specific tools for visualizing and navigating a non-linear development history), ditributed development(Git gives each developer a local copy of the entire development history), compatibility with existing systems/protocols, efficient handling of large projects, cryptographic authentication of history(changes made to old versions will be noticed), automatically performs garbage collection when enough loose objects have been created in the repository."},
 
 {"category":"IDE",
 "subcategory":"Eclipse",
 "definition":"Eclipse is an integrated development environment (IDE) used in computer programming. It contains a base workspace and an extensible plug-in system for customizing the environment. Eclipse is written mostly in Java and its primary use is for developing Java applications, but it may also be used to develop applications in other programming languages through the use of plugins, including: C, C++, COBOL, Fortran, JavaScript, Perl, PHP, Python, R, Ruby (including Ruby on Rails framework), Rust, Scala, Groovy etc.",
 "latestversion":"4.5.2(Mars)",
 "yearReleased":"2001",
 "ownedBy":"Eclipse Foundation",
 "keyFeatures":"The main features of Eclipse include syntax highlighting editor, incremental code compilation, a thread aware source level debugger, a class navigator, a file/project manager, interfaces to standard source control systems(CVS and ClearCase), code refactoring, automatic code updates/installs, task list, support for unit testing with JUnit and integration with Ant build tool etc."},
 
 {"category":"IDE",
 "subcategory":"XCode",
 "definition":"Xcode is an integrated development environment (IDE) containing a suite of software development tools developed by Apple for developing software for OS X, iOS, WatchOS and tvOS.",
 "latestversion":"7.3.1",
 "yearReleased":"2003",
 "ownedBy":"Apple Inc.",
 "keyFeatures":"Features include support for source code of many programming languages including C, C++, Java, Objective C, Python, Ruby, Swift etc., editor with advanced code completion, code folding, syntax highlighting, version editor which displays running timeline of commits and can graphically go back in time to compare source files, built-in interface, asset catalog editor for managing app's images in various resolutions, a graphical debugger etc."}
 
 ]
   